#include <iostream>
using namespace std;

int main() {
//  Мне надо найти наибольший общий делитель у двух натуральных чисел.
//	если числа натуральные, значит нету 0.
//	как это сделать?
//	я могу использовать деление нацело, т.е. % он должен быть 0
//	мне надо пробежаться по всем натуральным числа до наименьшего из них
//	т.к. деление должно быть нацело, и следовательно не может быть числа
//	выше наименьшего из них
//и мне надо запоминать эти числа пока не дойду до меньшего из них

	int a, b, denom, min;

	cin >> a >> b;

	min = a;
	if (min> b){
		min = b;
	}

	for (int i=1; i<= min; ++i){
		if (a % i == 0 && b % i == 0){
			denom = i;
		}
	}

	cout << denom << endl;


	return 0;
}

