#include <iostream>
using namespace std;

int main() {
//  Мне надо найти наибольший общий делитель у двух натуральных чисел.
//	если числа натуральные, значит нету 0.
//	как это сделать?
//	я могу использовать деление нацело, т.е. % он должен быть 0
//	мне надо пробежаться по всем натуральным числа до наименьшего из них
//	т.к. деление должно быть нацело, и следовательно не может быть числа
//	выше наименьшего из них
//и мне надо запоминать эти числа пока не дойду до меньшего из них

	int a, b;

	cin >> a >> b;
	// алгоритм Евклида
	while (a > 0 && b > 0){
		// возьмём большее из чисел и заменим его остатком от деления на второе
    // действительно, если a и b делятся на x, то a - b и b делятся на x
    // тогда и a % b и b делятся на x, так что можно a заменить на a % b
		if (a > b){
			a = a % b;
		}else {
			b = b % a;
		}
	}
	// если одно из чисел оказалось равно нулю, значит, на последней итерации
  // большее число разделилось на меньшее
	cout << a+b;

	return 0;
}

